package com.helphull.bistrenglish.text


var errorEnWords = mutableListOf<String>()
var errorRuWords = mutableListOf<String>()


//Набор слов на русском и английском

//Базовые глаголы 11*
val englishVerbsA1 = listOf("to be", "to do" ,"to feel", "to see", "to hear", "to run", "to get", "to make",
    "to cook", "to sing", "to speak", "to say", "to tell", "to take", "to sit", "to stand",
    "to laugh", "to smile", "to open", "to close", "to love", "to like", "to give", "to bring",
    "to breathe", "to buy", "to sell", "to forget", "to believe", "to have", "to go", "to know",
    "to think", "to come", "to want", "to use", "to find", "to work", "to eat", "to drink",
    "to write", "to read", "to call", "to try", "to need", "to become", "to put", "to leave",
    "to pay", "to play", "to pray", "to stay", "to mean", "to keep", "to let", "to begin",
    "to start", "to finish", "to help", "to show", "to cry", "to move", "to jump", "to live",
    "to die", "to happen", "to lose", "to hate", "to include", "to turn on", "to turn off",
    "to continue", "to change", "to wash", "to clean", "to lead", "to understand", "to watch",
    "to discover", "to imagine", "to introduce", "to follow", "to create", "to grow", "to spend",
    "to win", "to offer", "to learn", "to appear", "to disappear", "to build", "to break", "to send",
    "to fall", "to cut", "to achieve", "to communicate", "to kill", "to pass", "to fly", "to swim",
    "to decide", "to return", "to hope", "to explain", "to propose", "to develop", "to support",
    "to dance", "to draw", "to book", "to be afraid", "to agree", "to check up", "to delete",
    "to choose", "to catch", "to ask", "to answer", "to hesitate")

val russianVerbsA1 = listOf(
    "быть", "делать", "чувствовать", "видеть", "слышать", "бежать", "получать", "создавать",
    "готовить", "петь", "говорить", "говорить", "сказать", "взять", "сидеть", "стоять",
    "смеяться", "улыбаться", "открывать", "закрывать", "любить", "нравиться", "давать", "принести",
    "дышать", "купить", "продать", "забыть", "верить", "иметь", "идти", "знать",
    "думать", "приходить", "хотеть", "использовать", "найти", "работать", "есть", "пить",
    "писать", "читать", "звонить", "пытаться", "нужно", "стать", "класть", "оставить",
    "платить", "играть", "молиться", "оставаться", "значить", "держать", "позволять", "начинать",
    "начать", "закончить", "помогать", "показывать", "плакать", "двигаться", "прыгать", "жить",
    "умирать", "случаться", "терять", "ненавидеть", "включать", "включить", "выключить",
    "продолжать", "менять", "мыть", "чистить", "вести", "понимать", "смотреть", "открывать",
    "представлять", "представить", "следовать", "создавать", "расти", "тратить", "выиграть",
    "предлагать", "учить", "появляться", "исчезать", "строить", "ломать", "отправлять",
    "падать", "резать", "достигать", "общаться", "убить", "пройти", "летать", "плавать",
    "решать", "возвращаться", "надеяться", "объяснять", "предлагать", "разрабатывать", "поддерживать",
    "танцевать", "рисовать", "бронировать", "бояться", "соглашаться", "проверять", "удалить",
    "выбрать", "ловить", "спросить", "ответить", "колебаться")

val randomRussianVerbsA1 = listOf("радовать", "грустить", "уважать", "критиковать", "хвалить",
    "ругать", "шутить", "молчать", "кричать", "шептать", "беседовать", "велеть", "вертеть",
    "вздыхать", "взлетать", "взрывать", "включаться", "влетать", "внимать", "возвращать",
    "возить", "возмущать", "ворочать", "врать", "вспоминать", "вставать", "встречать",
    "входить", "выбираться", "выглядеть", "выживать", "выключаться", "вылетать", "выносить",
    "выражать", "выручать", "выслушивать", "выступать", "вытирать, стирать", "вытягивать",
    "гадать", "гладить", "гнать", "готовиться", "греть", "грызть", "двигать", "дразнить",
    "дрожать", "жалеть", "жаловаться", "желать", "жениться", "забывать", "завидовать", "загорать",
    "задерживать", "заказывать", "закрываться", "замечать", "занимать", "записывать",
    "запрещать", "зарабатывать", "защищать", "злиться", "знакомить, представляться", "играться",
    "изменять", "изучать", "интересовать", "испугать", "исчезать, пропадать", "кататься",
    "кидать", "клеить", "копать", "кормить", "красить", "красть", "кружить", "курить", "кушать",
    "лазить", "лепить", "лечить, спасать", "ломать, уничтожать", "махать", "мешать",
    "рвать", "метать", "фехтовать", "мочить", "мучить", "мыть, тереть", "наблюдать, видеть",
    "надевать", "называть", "наказывать", "наклонять", "наполнять", "негодовать",
    "нести", "низвергать", "носить", "обедать", "обещать", "обнимать", "оборачивать", "обучать",
    "огорчать", "одевать", "оказывать", "опаздывать", "опускать", "освобождать", "останавливать",
    "отвлекать", "отдыхать", "отказывать", "отличать", "отпускать", "отражать", "отрывать",
    "отставать", "отходить", "охранять", "ошибаться", "передвигать", "переживать", "переходить",
    "печатать", "пинать", "планировать", "плевать", "плыть", "погибать, умирать", "поднимать",
    "подозревать", "подписывать", "подходить", "поедать", "ползать", "попадать", "поправлять",
    "поражать", "портить", "посещать", "похвалить", "похищать", "править, управлять", "превращать",
    "презирать, унижать", "прекращать, останавливаться", "препятствовать", "приближать",
    "приводить", "приглашать", "придумывать", "приезжать", "признавать", "приказывать",
    "принимать", "приносить", "принадлежать", "пробовать, употреблять", "прогнозировать",
    "продавать", "проезжать", "производить", "просить", "просыпаться", "прятать, жадничать",
    "пугать", "путешествовать", "радоваться", "разбивать", "разговаривать", "разделять, разрывать",
    "разрешать", "разрушать", "ранить", "рассказывать", "расслаблять", "рассматривать",
    "расстраивать", "расходиться", "реагировать", "рожать", "руководить", "рыдать", "садиться",
    "светить", "свистеть", "свободно", "сгорать", "сдавать", "сесть", "складывать", "скрывать",
    "следить", "снимать", "собирать", "созревать", "сойти", "сопротивляться", "сохранять",
    "спасать", "спорить", "спрашивать", "спускаться", "сравнивать", "сражаться, биться", "ставить",
    "стараться", "становиться", "стесняться", "стоить", "стрелять", "стучать", "судить, обсуждать",
    "существовать", "схватить", "считать", "съесть", "сыграть", "тащить, волочь", "твердить"
)

// Существительные вокруг света 12*

val englishNounsWordAroundA1 = listOf("air","wind","water","west","east","north","south","tree","sea","ocean",
    "rock","plant","flower","forest","person","night","morning","day","evening","life","mountain",
    "land","house","fire","country","animal","bird","fish","insect","city","world")

val russianNounsWordAroundA1 = listOf("воздух","ветер","вода","запад","восток","север","юг","дерево","море","океан",
    "камень","растение","цветок","лес","человек","ночь","утро","день","вечер","жизнь","гора",
    "земля","дом","огонь","страна","животное","птица","рыба","насекомое","город","мир")

val randomRussianNounsWorldA1 = listOf("солнце","луна","звезда","небо","облако","дождь","снег","град","гроза",
    "молния","радуга","туман","река","озеро","ручей","болото","пустыня","степь","холм","долина","пещера",
    "остров","материк","вулкан","песок","глина","почва","трава","куст","лист","корень","плод","ягода",
    "гриб","семя","ветка","ствол","кора","тень","свет","тепло","холод","лед","пар","дым","пламя",
    "искра","пепел","уголь","металл","золото","серебро","железо","медь","алмаз","рубин","изумруд",
    "кристалл","стекло","керамика","пластик","бумага","ткань","кожа","шерсть","шелк",
    "хлопок","лен","нить","игла","ножницы","молоток","гвоздь","веревка","цепь","ключ","замок",
    "книга","журнал","газета","письмо","конверт","ручка","карандаш","краска","кисть","холст",
    "музыка","песня","танец","театр","кино","спорт","игра","праздник","подарок","цвет","форма",
    "размер","вес","объем","поверхность","глубина","высота","ширина","длина","расстояние",
    "скорость","время","час","минута","секунда","неделя","месяц","год","век","эпоха","история",
    "будущее","настоящее","прошлое","мечта","цель","план","идея","мысль","знание","опыт","умение",
    "навык","работа","отдых","сон","здоровье","болезнь","лекарство","врач","больница","школа",
    "учитель","ученик","урок","задача","пример","ответ","вопрос","загадка","тайна","секрет",
    "правда","ложь","дружба","любовь","ненависть","радость","грусть","страх","гнев","спокойствие",
    "удача","неудача","победа","поражение","риск","опасность","безопасность","свобода","рабство")

// Существительные семья 13*

val enNounsFamilyA1 = listOf("boy","girl","mother", "father","son","daughter","baby","family",
    "grand mother", "grand father","children","home","love","apartment","joy","nephew","aunt",
"uncle","cousin","man","woman","child","sister","brother","relatives","friend","wife",
"husband","address","happiness","people")

val ruNounsFamilyA1 = listOf("мальчик","девочка","мама","отец","сын","дочь","малыш",
"семья","бабушка","дедушка","дети","дом","любовь","квартира","радость","племянник",
"тетя","дядя","двоюроднаясестра/брат","мужчина","женщина","ребенок","сестра","брат",
"родственники","друг","жена","муж","адрес","счастье","люди")

val randomRuNounsFamilyA1 = listOf(
    "двоюродная сестра/брат", "родители", "внук", "внучка", "прабабушка", "прадедушка", "правнук",
    "правнучка", "свекровь", "свекор", "теща", "тесть", "невестка", "зять", "сноха", "деверь",
    "золовка", "шурин", "сват", "сватья", "крестный отец", "крестная мать", "крестник", "крестница",
    "кум", "кума", "попечитель", "опекун", "подопечный", "приемный ребенок", "приемные родители",
    "родной брат", "родная сестра", "сводный брат", "сводная сестра", "единокровный брат",
    "единокровная сестра", "единоутробный брат", "единоутробная сестра", "двоюродный брат",
    "двоюродная сестра", "троюродный брат", "троюродная сестра", "племянница", "внучатый племянник",
    "внучатая племянница", "двоюродный дедушка", "двоюродная бабушка", "троюродный дедушка",
    "троюродная бабушка", "прапрадедушка", "прапрабабушка", "праправнук", "праправнучка",
    "крестный сын", "крестная дочь", "крестный брат", "крестная сестра", "крестный внук",
    "крестная внучка", "крестный дедушка", "крестная бабушка", "крестный правнук",
    "крестная правнучка", "крестный прадедушка", "крестная прабабушка", "крестный праправнук",
    "крестная праправнучка", "крестный прапрадедушка", "крестная прапрабабушка"
)

//Соц коммуникация 14*

val enNounsSocialA1 = listOf("phone","question","place","market","order","food","work",
    "communication","story","relax","time","word","dialogue","meeting","week","distance",
    "club","theatre","cinema","coffee shop","friendship","behavior","attitude","student",
    "university","union","party","date","sweetheart","leisure time")

val ruNounsSocialA1 = listOf("телефон","вопрос","место","рынок","заказ","еда","работа","общение",
    "история","отдых","время","слово","диалог","встреча","неделя","дистанция","клуб","театр",
    "кинотеатр","кофейня","дружба","поведение","отношение","студент","университет","объединение",
    "вечеринка","свидание","возлюбленный","досуг")

val randomRuNounsSocialA1 = listOf(
   "разговор","обсуждение","дискуссия","дебаты","переговоры","совещание","конференция",
"семинар","лекция","презентация","доклад","выступление","речь","монолог","комментарий",
"ответ","реакция","обратнаясвязь","критика","похвала","совет","рекомендация","предложение",
"идея","мнение","точказрения","аргумент","доказательство","факт","информация","новость",
"сообщение","письмо","записка","электроннаяпочта","чат","социальнаясеть","форум",
"блог","подкаст","видеоконференция","вебинар","трансляция","стрим","интервью","опрос",
"анкета","исследование","анализ","статистика","тренд","тема","сюжет","контекст",
"содержание","форма","стиль","тон","эмоция","настроение","эмпатия","сочувствие",
"поддержка","сотрудничество","команда","коллектив","группа","сообщество","аудитория",
"публика","зритель","слушатель","читатель","подписчик","участник","организатор",
"модератор","спикер","эксперт","специалист","консультант","ментор","коуч","тренер",
"лидер","последователь","партнерство","соглашение","договор","компромисс","конфликт",
"спор","разногласие","примирение","согласие","единство","солидарность","взаимодействие",
"интеграция","адаптация","изменение","развитие","прогресс","инновация","творчество",
"вдохновение","мотивация","цель","задача","план","стратегия","тактика","результат",
"успех","достижение","опыт","знание","навык","умение","компетенция","профессионализм",
"ответственность","доверие","репутация","имидж","бренд","реклама","продвижение",
"маркетинг","публичность","популярность","влияние","авторитет","личность","индивидуальность",
"характер","темперамент","привычка","традиция","культура","ценность","принцип","этика",
"мораль","нравственность","честность")

//База слов туриста 15*

val enNounsTouristA1 = listOf("road","ticket","map","motel","highway","reception","wallet","bank",
    "subway","cab","parking","food order","cash","passport","permission","lawyer","problem",
    "waiting room","transfer","bag","suitcase","property","law","police station","price",
    "price list","courier","delivery","location","route","agreement","hospital","ambulance")

val ruNounsTouristA1 = listOf("дорога","билет","карта","мотель","шоссе","регистратура, ресепшн",
    "бумажник","банк","метро","такси","парковка","заказ еды","наличные","паспорт","разрешение",
    "адвокат","проблема","зал ожидания","пересадка","сумка","чемодан","имущество","право, закон",
    "полицейский участок","стоимость, цена","ценник","курьер","доставка","местоположение","маршрут",
    "договор","больница","скорая помощь")

val randomRuNounsTouristA1 = listOf("путешествие", "отдых", "курорт", "отель", "гостиница",
    "хостел", "пляж", "горы", "лес",
    "река", "озеро", "море", "океан", "парк", "заповедник", "достопримечательность", "музей",
    "галерея", "замок", "собор", "храм", "памятник", "экскурсия", "гид", "тур",
    "поезд", "автобус", "круиз", "яхта", "велосипед", "пеший поход", "альпинизм", "дайвинг",
    "сноркелинг", "сёрфинг", "лыжи", "сноуборд", "каякинг", "рафтинг", "сафари", "кемпинг",
    "палатка", "костер", "рюкзак", "спальник", "фонарь", "компас", "фотоаппарат",
    "сувенир", "магазин", "рынок", "ресторан", "кафе", "бар", "кухня", "блюдо", "напиток",
    "экзотика", "природа", "культура", "традиция", "фестиваль", "праздник", "язык", "общение",
    "гид", "переводчик", "бронь", "бронирование", "скидка", "акция", "туроператор", "агентство",
    "виза", "таможня", "багаж", "рейс", "аэропорт", "вокзал", "порт", "транспорт", "прогулка",
    "приключение", "открытие", "впечатление", "воспоминание", "фотография", "видео", "блог",
    "отзыв", "рекомендация", "совет", "план", "бюджет", "экономия", "роскошь",
    "комфорт", "удобство", "безопасность", "страхование", "медицина", "аптека", "солнцезащитный крем",
    "очки", "шляпа", "купальник", "полотенце", "зонт")

//Базовые прилагательные 16*

val enAdjectivesA1 = listOf("afraid", "angry", "asleep")/*, "attentive", "available", "basic",
    "beautiful", "big", "brave", "busy", "calm", "careful", "cheap", "clean", "clever", "cold",
    "comfortable", "confident", "constant", "curious", "dangerous", "dark", "deep", "different",
    "difficult", "dirty", "easy", "every", "expensive", "exact", "fast", "fair", "fine", "foreign",
    "free", "fresh", "full", "funny", "guilty", "healthy", "hard", "helpful", "honest", "hot",
    "hungry", "important", "illegal", "impossible", "independent", "interesting", "kind", "legal",
    "little", "lucky", "necessary", "normal", "old", "opposite", "perfect", "poor", "powerful",
    "possible", "quiet", "rare", "recent", "relevant", "remote", "safe", "short", "small",
    "strange", "successful", "tasty", "terrible", "tired", "warm", "weak", "responsible", "sad",
    "international")*/

val ruAdjectivesA1 = listOf("напуганный", "сердитый", "спящий")/*, "внимательный", "доступный", "базовый",
    "красивый", "большой", "смелый", "занятой", "спокойный", "внимательный, заботливый", "дешевый",
    "чистый", "умный", "холодный",
    "комфортный", "уверенный", "постоянный", "любопытный", "опасный", "темный", "глубокий", "разный",
    "трудный", "грязный", "легкий", "каждый", "дорогой", "точный", "быстрый", "честный",
    "замечательный", "иностранный", "свободный", "свежий", "полный", "забавный", "виновный",
    "здоровый", "тяжелый", "полезный", "честный", "горячий", "голодный", "важный",
    "нелегальный, незаконный", "невозможный", "независимый", "интересный", "добрый", "законный",
    "маленький", "удачливый", "необходимый", "нормальный", "старый", "противоположный", "идеальный",
    "бедный", "мощный", "возможный", "тихий", "редкий", "недавний", "релевантный, актуальный",
    "удаленный", "безопасный", "короткий", "маленький", "странный, незнакомый, чужой", "успешный",
    "вкусный, приятный", "жуткий", "усталый", "теплый", "слабый", "ответственный, надежный",
    "грустный", "международный")*/

val randomRuAdjectivesA1 = listOf("активный", "аккуратный", "алчный", "амбициозный", "ангельский",
    "античный", "ароматный", "безумный", "беспокойный", "бессмертный", "блестящий", "богатый",
    "божественный", "болезненный", "бордовый", "броский", "бывалый", "великолепный",
    "величественный", "верный", "весёлый", "ветхий", "влажный", "влиятельный", "внезапный",
    "внушительный", "водянистый", "возбуждённый", "волшебный", "вонючий", "восторженный",
    "вредный", "выносливый", "гармоничный", "гигантский", "гладкий", "глупый", "гнилой",
    "гордый", "горький", "гостеприимный", "грациозный", "громкий", "грубый", "дальний",
    "дерзкий", "детский", "дикий", "длинный", "добродушный", "добросовестный", "доверчивый",
    "дождливый", "домашний", "достойный", "драгоценный", "древний", "душевный", "едкий",
    "естественный", "жадный", "жаркий", "желанный", "железный", "жестокий", "живой", "жирный",
    "загадочный", "задумчивый", "закрытый", "замкнутый", "звонкий", "зелёный", "злобный",
    "зловещий", "знаменитый", "игривый", "известный", "изменчивый", "импульсивный", "интенсивный",
    "искренний", "искусственный", "испуганный", "истинный", "капризный", "кислый",
    "коварный", "колоритный", "комичный", "космический", "красноречивый", "креативный", "кривой",
    "круглый", "крутой", "ласковый", "ленивый", "летучий", "лживый", "ловкий", "лучезарный",
    "любезный", "любознательный", "магический", "малый", "медленный", "мелодичный", "мерзкий",
    "мерцающий", "мечтательный", "милый", "мимолётный", "мирный", "многочисленный", "модный",
    "мокрый", "молчаливый", "мрачный", "мудрый", "мужественный", "мягкий", "мятежный", "наглый",
    "наивный", "напряжённый", "настоящий", "небесный", "невидимый", "невинный", "нежный",
    "нездоровый", "некрасивый", "непобедимый", "неподдельный", "непредсказуемый", "нерешительный",
    "неуклюжий", "неуловимый", "неутомимый", "нечестный", "низкий", "ночной", "обманчивый",
    "обидчивый", "общительный", "огненный", "одарённый", "озорной", "оптимистичный", "органичный",
    "осторожный", "острый", "отважный", "открытый", "отличный", "очаровательный", "пассивный",
    "печальный", "пластичный", "плотный", "поверхностный", "подвижный", "подлый",
    "позитивный", "покорный", "понятливый", "популярный", "потерянный", "похотливый",
    "пошлый", "правдивый", "преданный", "прекрасный", "привлекательный", "призрачный",
    "примитивный", "приятный", "прозрачный", "проклятый", "простой", "прохладный",
    "прямой", "пугающий", "пугливый", "пустой", "пыльный", "равнодушный", "радостный",
    "раздражительный", "разноцветный", "ранимый", "рассеянный", "расслабленный",
    "растерянный", "реалистичный", "ревнивый", "резкий", "решительный", "робкий",
    "романтичный", "роскошный", "рыжий", "светлый", "священный", "серьёзный", "сильный",
    "сказочный", "скромный", "скучный", "сладкий", "сложный", "смешной", "смуглый",
    "смущённый", "снежный", "современный", "солёный", "солнечный", "сонный", "сообразительный",
    "сострадательный", "спортивный", "справедливый", "строгий", "стыдливый", "суетливый",
    "сухой", "счастливый", "тайный", "твёрдый", "творческий", "тёмный", "толстый", "тонкий",
    "торжественный", "тревожный", "трудолюбивый", "туманный", "тупой", "удивительный", "удобный",
    "ужасный", "узкий", "уникальный", "упрямый", "уродливый", "утончённый", "уютный",
    "фантастический", "хитрый", "хрупкий", "цветущий", "ценный", "целеустремлённый", "циничный",
    "честолюбивый", "чувствительный", "чудесный", "шумный", "щедрый", "эгоистичный", "экзотический",
    "экстравагантный", "элегантный", "энергичный", "эффектный", "юморной", "ядовитый",
    "яркий", "яростный", "ясный")

// Базовые наречия 17*

val enAdverbsA1 = listOf("together", "according", "again", "always", "beautifully",
    "carefully", "correctly", "especially", "friendly", "indeed", "above", "accidentally",
    "actually", "badly", "besides", "briefly", "certainly", "daily", "dreamily", "even",
    "eventually", "foolishly", "forward", "ever", "equally", "fortunately", "honestly",
    "instead", "inside", "also", "hardly", "lately", "less", "loudly", "nearly", "never",
    "only", "once", "often", "perhaps", "quickly", "probably", "rarely", "really", "sometimes",
    "yesterday", "thus", "somehow", "soon", "regularly", "somewhere")

val ruAdverbsA1 = listOf("вместе", "в соответствии", "снова", "всегда", "красиво", "осторожно",
    "верно, правильно", "особенно", "дружелюбно", "действительно", "выше", "случайно",
    "на самом деле", "плохо", "помимо этого", "кратко", "конечно", "ежедневно", "мечтательно",
    "даже", "в конце концов", "глупо", "вперед", "когда-либо", "одинаково", "к счастью",
    "честно", "вместо", "внутри", "также", "с трудом", "недавно", "меньше", "громко, шумно",
    "около", "никогда", "только", "один раз", "часто", "возможно", "быстро", "вероятно", "редко",
    "действительно", "иногда", "вчера", "таким образом", "как-то", "скоро", "регулярно", "где-то")

val randomRuAdverbsA1 = listOf("активно", "беспрерывно", "блестяще", "внимательно", "волнительно",
    "вперемешку", "вплотную", "вручную", "вслепую", "вслух", "второпях", "вынужденно", "горячо",
    "грациозно", "деловито", "дивно", "добровольно", "долго", "достаточно", "еле-еле",
    "естественно", "жалобно", "жарко", "желательно", "заботливо", "заметно", "заодно",
    "заранее", "здорово", "идеально", "изредка", "искренне", "исступленно", "категорически",
    "криво", "круто", "ласково", "лениво", "медлительно", "мгновенно", "мельком", "мрачно",
    "наверняка", "наглядно", "надежно", "намеренно", "напрямую", "нарочно", "настоятельно",
    "небрежно", "негромко", "нежно", "незаметно", "неловко", "неохотно", "неприятно", "нервно",
    "неуверенно", "обоюдно", "оживленно", "откровенно", "охотно", "печально", "плавно", "подолгу",
    "позорно", "покамест", "поначалу", "попеременно", "порядочно", "последовательно", "постоянно",
    "по-своему", "по-другому", "преданно", "прилежно", "прямо", "равномерно", "радостно",
    "разумно", "ревниво", "резво", "решительно", "сдержанно", "сердито", "серьезно", "скромно",
    "сложно", "смешно", "смутно", "снисходительно", "сознательно", "спокойно", "старательно",
    "строго", "сухо", "тревожно", "убедительно", "уверенно", "удивительно", "ужасно", "умело",
    "упрямо", "усердно", "успешно", "холодно", "хорошо", "храбро", "целенаправленно",
    "чрезвычайно", "шутливо", "энергично", "ясно")

// 170 глаголов A2 21*

val enVerbsA2 = listOf("to appear", "to cancel", "to bite", "to regret", "to blow", "to compose",
    "to congratulate", "to correct", "to fall asleep", "to burn", "to invent", "to mention",
    "to suppose", "to suggest", "to consider", "to escape", "to publish", "to solve", "to tidy up",
    "to win", "to swallow", "to follow", "to abandon", "to be able", "to abuse", "to accelerate",
    "to reveal", "to consist of", "to include", "to guess", "to accept", "to formulate", "to form",
    "to achieve", "to acknowledge", "to act", "to adhere", "to admire", "to adjust", "to advise",
    "to allow", "to improve", "to edit", "to conclude", "to settle", "to handle", "to boost",
    "to amplify", "to appeal", "to assemble", "to assess", "to assist", "to astonish", "to assure",
    "to avoid", "to await", "to pick up", "to cross off", "to claim", "to hurry up", "to find out",
    "to divide", "to bark", "to bathe", "to beat", "to blackmail", "to spent", "to send",
    "to laugh", "to struggle", "to motivate", "to perceive", "to receive", "to recognize",
    "to remain", "to retain", "to remember", "to observed", "to fight", "to renew",
    "to keep calm", "to break up", "to focus", "to perform", "to offer", "to display",
    "to behave", "to get rid", "to squeeze", "to release", "to push", "to foster",
    "to enhance", "to develop", "to envelop", "to obtain", "to investigate",
    "to adore", "to block out", "to boil", "to bother", "to breathe", "to brew",
    "to celebrate", "to broadcast", "to modify", "to bump", "to buzz", "to lead",
    "to call back", "to waste", "to take care", "to carry out", "to carve", "to cease",
    "to collaborate", "to reward", "to come back", "to relate", "to upgrade", "to restore",
    "to describe", "to share", "to increase", "to automate", "to manage", "to provide",
    "to integrate", "to realize", "to remind", "to install", "to download", "to unpack",
    "to engage", "to create", "to prefer", "to inspire", "to apply", "to explain",
    "to simplify", "to strive", "to arrive", "to enable", "to support", "to allot",
    "to empower", "to overwhelm", "to fulfill", "to take over", "to encourage",
    "to stimulate", "to cause", "to deal", "to reach", "to touch", "to attain",
    "to require", "to figure out", "to forgive", "to light", "to shine", "to spread",
    "to throw", "to spoil", "to split", "to go mad", "to steal", "to smell"
)

val ruVerbsA2 = listOf("появляться", "отменять", "кусать", "сожалеть",
    "дуть", "составлять", "поздравлять", "исправлять",
    "засыпать", "гореть", "изобретать", "упоминать, заметить, отметить",
    "предполагать", "предлагать, намекать", "размышлять, учитывать", "сбегать, убегать",
    "публиковать", "решить, разгадать", "убираться, наводить порядок", "выиграть",
    "глотать", "следовать", "покидать", "быть в состоянии", "оскорблять",
    "ускорять", "раскрывать", "состоять из", "включать", "думать, предполагать",
    "одобрять, согласовать", "формулировать", "формировать", "достигать", "подтверждать",
    "действовать", "придерживаться", "восхищаться", "адаптировать, настроить",
    "советовать", "позволять, разрешать", "улучшать", "редактировать", "включать в себя",
    "располагаться", "справиться", "увеличить, поддержать",
    "усилить, расширить", "просить, обращаться", "собираться, созывать",
    "оценивать, рассматривать", "присутствовать, помогать", "удивлять", "убеждать, заверять",
    "избегать", "ожидать", "подбирать, забирать", "вычеркивать", "утверждать, заявлять",
    "торопиться", "находить", "делить, разделять", "лаять", "купаться", "бить, превосходить",
    "шантажировать", "тратить", "посылать", "смеяться", "бороться", "мотивировать",
    "воспринимать", "получать", "распознавать", "напоминать", "удержать", "помнить, запоминать",
    "исследовать", "драться", "обновлять", "успокаиваться", "разрушать, расходиться",
    "фокусироваться", "исполнять обязанности", "предлагать", "отображать", "вести себя",
    "избавляться", "выжимать", "выпускать, публиковать", "толкать", "поощрять",
    "расширять, поощрять", "развивать, разрабатывать", "окутывать, обволакивать",
    "получить, добиться, приобрести", "расследовать", "обожать", "блокировать", "кипеть",
    "побеспокоить", "дышать", "варить, заваривать", "отмечать",
    "вещать, транслировать", "изменять, модифицировать", "ударять", "жужжать",
    "вести, лидировать, быть лидером", "перезвонить", "тратить впустую, мусорить", "заботиться",
    "выполнять, осуществлять", "вырезать", "прекратить", "сотрудничать",
    "награждать", "возвращаться", "относиться, касаться", "обновлять", "восстановить",
    "описывать", "делиться", "увеличивать", "автоматизировать", "управлять", "обеспечивать",
    "соединять, интегрировать", "реализовывать, осуществлять", "напоминать", "устанавливать",
    "загружать", "распаковать", "увлечь, привлечь", "создавать", "предпочитать", "вдохновлять",
    "применять", "объяснять", "упрощать", "стремиться", "прибывать", "разрешить, включить",
    "поддерживать", "выделить", "разрешать, уполномочить", "переполнять", "выполнять",
    "принять на себя", "поощрять", "стимулировать", "вызывать", "справляться", "достигать",
    "прикасаться", "достигать, получать", "запрашивать, требовать", "разбираться", "прощать",
    "освещать, светить", "сиять", "распространять", "бросать", "испортить", "разбить, разделить",
    "сходить с ума", "украсть", "пахнуть"
)

val randomRuVerbsA2 = randomRussianVerbsA1 // если будут ошибки, то заменить

// Работа 22*

val enNounsJobA2 = listOf("activity", "amount", "author", "character", "dictionary", "event",
    "guess", "dashboard", "task manager", "sick day", "trouble", "deadline", "reason",
    "to-do list", "remark", "proofreading", "performance", "co-working space", "duty",
    "function", "burnout", "goal", "timetable", "area", "state", "mentoring", "tiredness",
    "probation period", "expectation", "benefit", "salary", "outsource", "team", "lead",
    "project", "check out", "research", "routine", "planner", "schedule"
)

val ruNounsJobA2 = listOf("деятельность", "сумма, количество", "автор", "характер", "словарь",
    "событие", "предположение, догадка", "панель управления", "планировщик задач", "больничный",
    "проблема", "дедлайн", "причина, смысл", "список дел", "замечание, ремарка",
    "редактирование, вычитка", "исполнение, выступление", "ко-воркинг", "обязанность", "функция",
    "выгорание", "цель", "расписание", "сфера, область", "состояние, положение", "менторство",
    "усталость", "испытательный срок", "ожидание", "прибыль", "зарплата", "аутсорс", "команда",
    "лидер, тимлидер", "проект", "проверка", "исследование", "рутина", "планнер, блокнот",
    "расписание"
)

val randomRuNounsJobA2 = listOf("работа", "карьера", "должность", "профессия", "специалист",
    "коллега", "начальник", "подчиненный", "офис", "график", "задача", "результат", "успех",
    "достижение", "продвижение", "повышение", "навык", "опыт", "знание", "обучение", "стажировка",
    "контракт", "трудоустройство", "резюме", "собеседование", "рекрутер", "вакансия",
    "работодатель", "сотрудник", "кадры", "отдел", "управление", "руководство", "ответственность",
    "инициатива", "мотивация", "дисциплина", "эффективность", "производительность", "ресурсы",
    "инструмент", "технология", "инновация", "стратегия", "тактика", "решение",
    "конфликт", "компромисс", "переговоры", "презентация", "отчет", "документ", "архив", "бюджет",
    "финансы", "инвестиция", "рост", "развитие", "конкуренция", "рынок", "клиент", "партнер",
    "сотрудничество", "сделка", "договор", "условие", "требование", "стандарт", "качество",
    "контроль", "аудит", "анализ", "отчетность", "план", "этап", "процесс", "регламент",
    "инструкция", "корпорация")

// Досуг 23*

val enNounsRestA2 = listOf("cartoon", "movie", "circus", "composer", "dream", "daily routine",
    "horror", "laughter", "novel", "story", "weather forecast", "thought", "writer", "access",
    "account", "adventure", "affair", "anniversary", "entertainment", "amusement", "influence",
    "attraction", "rock-climbing", "cycling", "number painting", "swimming pool", "yoga",
    "coffee shop", "central park", "inspiration", "scenery", "landscape", "computer game",
    "mood", "situation", "movement", "arrangement", "accommodation", "beverage", "binge"
)

val ruNounsRestA2 = listOf("мультфильм","фильм", "цирк", "композитор", "мечта", "ежедневная рутина",
    "ужастик",
    "смех", "роман", "история", "прогноз погоды", "мысль", "писатель", "доступ", "аккаунт",
    "приключение", "страх", "дело, интрига", "развлечение", "веселье", "влияние",
    "достопримечательность, аттракцион", "скалолазание", "катание на велосипеде",
    "живопись по номерам", "бассейн", "йога", "кофейня", "центральный парк", "вдохновение",
    "пейзаж", "ландшафт, пейзаж", "компьютерная игра", "настроение", "ситуация", "движение",
    "договоренность", "жилье", "напиток", "гулянка"
)

val randomRuNounsRestA2 = listOf(
    "отдых", "досуг", "парк", "прогулка", "пикник", "кемпинг",
    "поход", "рыбалка", "охота", "спорт", "футбол", "волейбол", "теннис", "бадминтон", "плавание",
    "бег", "ходьба", "танцы", "концерт", "театр", "музей", "выставка", "галерея", "кино", "сериал",
    "музыка", "песня", "альбом", "книга", "журнал", "газета", "кроссворд", "пазл",
    "настольная игра", "шашки", "карты", "рукоделие", "вязание", "вышивание", "рисование",
    "фотография", "садоводство", "цветоводство", "готовка", "рецепт", "барбекю", "вечеринка",
    "праздник", "день рождения", "свадьба", "путешествие", "тур", "экскурсия", "отель", "курорт",
    "пляж", "море", "горы", "лес", "река", "озеро", "водопад", "закат", "рассвет", "звезды",
    "луна", "солнце", "природа", "сауна", "баня", "массаж", "спа", "медитация", "чтение", "письмо",
    "поэзия", "сон", "релаксация"
)

// Климат и защита природы 24*

val enNounsNatureA2 = listOf("activist", "pollution", "impurity", "algae", "Earth", "atmosphere",
    "environment", "climate", "air", "water reserve", "greenhouse effect", "oxygen", "explorer",
    "investigation", "future", "tropic forest", "humidity", "flora", "wildlife", "plastic waste",
    "А recycling", "hydrosphere", "meeting", "background", "bank", "banner", "beast", "cave",
    "caviar", "charity", "chemistry", "economical use", "coal", "commitment", "concern",
    "conscience", "court", "custody", "desert", "dimension", "disaster", "disease", "downturn",
    "drain", "emphasis", "engine", "evidence", "excess", "famine", "detriment"

)

val ruNounsNatureA2 = listOf("активист", "загрязнение", "примеси", "водоросли", "земля",
    "атмосфера", "окружающий мир", "климат", "воздух", "водные ресурсы", "парниковый эффект",
    "кислород", "исследователь", "расследование", "будущее", "тропический лес", "влажность, влага",
    "флора", "дикая природа, животные", "пластиковые отходы", "переработка", "гидросфера", "митинг",
    "происхождение, фон", "берег", "баннер", "зверь, животное", "пещера", "икра",
    "благотворительность", "химия", "экономное потребление", "уголь", "обязательство",
    "озабоченность", "совесть, сознание", "суд", "опека, сохранение", "пустыня", "измерение",
    "катастрофа", "заболевание", "убыток, спад", "сток, слив", "акцент", "двигатель",
    "доказательство", "превышение", "голод", "ущерб")

val randomRuNounsNatureA2 = listOf(
    "лес", "смог", "река", "выбросы", "озеро", "токсины, химикаты", "гора", "отходы", "вулкан", "мусор",
    "ледник", "шлаки", "снег", "сажа, копоть", "дождь, морось", "нефть", "град", "мазут", "ветер", "бензол",
    "ураган", "радиация", "тайфун", "пепел", "цунами", "зола, пепел", "радуга", "аэрозоль", "туман",
    "пыль", "роса", "дым", "иней", "кислотный дождь", "гроза, молния", "нитраты, удобрения", "молния", "фосфаты",
    "гром", "пестициды", "солнце", "гербициды", "луна", "ртуть", "звезда", "свинец", "облако",
    "кадмий", "песок", "полимеры", "камень, валун", "шум", "почва", "вибрация", "глина", "эрозия",
    "торф", "засоление", "болото", "деградация", "оазис", "каньон", "ущелье", "водопад", "ручей",
    "родник, ручей", "луг, поле", "степь", "тундра", "саванна", "холм", "склон", "вершина", "подножье",
    "долина", "плато", "остров", "полуостров", "архипелаг", "пролив", "залив", "фьорд", "риф",
    "коралл", "парк", "заповедник", "национальный парк", "заказник", "резерват", "экосистема",
    "биом", "ландшафт", "рельеф", "климатический пояс", "сезон", "весна", "лето", "осень", "зима",
    "погода")

// Прилагательные А2 25*

val enAdjectivesA2 = listOf("blind", "catchy", "common", "familiar", "frequent", "recurrent",
    "enormous", "expensive", "valuable", "muslim", "lucky", "clear", "scientific", "huge", "messy",
    "unforgettable", "false", "fierce", "explicit", "exterior", "hidden", "powerful", "internal",
    "fabulous", "beautiful", "gorgeous", "fruitful", "formidable", "fortunate", "frail",
    "friendly", "loyal", "general", "generous", "gradual", "productive", "protected", "hardy",
    "peaceful", "digital", "social", "hideous", "awful", "awesome", "high-quality", "helpless",
    "hilarious", "idle", "immediate", "main", "european", "simultaneous", "special", "visible",
    "honest", "mortal", "hyperactive", "personal", "foolish", "sudden")

val ruAdjectivesA2 = listOf("слепой", "броский", "распространенный", "знакомый", "частый",
    "повторяющийся", "огромный", "дорогой", "ценный", "мусульманский", "удачный", "чистый",
    "научный", "большой", "беспорядочный", "незабываемый", "неверный", "свирепый",
    "ярко выраженный", "внешний", "скрытый", "мощный", "внутренний", "невероятный", "красивый",
    "великолепный", "плодотворный", "замечательный", "удачливый, счастливый", "хилый, хрупкий",
    "дружелюбный", "лояльный", "общий, генеральный", "щедрый", "постепенный", "продуктивный",
    "защищенный", "выносливый", "мирный, миролюбивый", "цифровой", "социальный", "отвратительный",
    "ужасный", "милый", "высококачественный", "беспомощный", "уморительный", "безработный",
    "незамедлительный", "главный", "европейский", "одновременный", "специальный", "видимый",
    "честный", "смертельный", "гиперактивный", "личный", "глупый", "внезапный")

val randomRuAdjectivesA2 = listOf("активный, бодрый","адекватный","азартный","аккуратный","аппетитный",
    "ароматный","бедный, нищий","безмятежный, спокойный","безнадежный","безупречный","белый","благодарный",
    "благородный","бледный","блестящий","близкий","богатый","бодрый","бойкий","болтливый",
    "быстрый","важный","вежливый","великий","верный","веселый","ветхий","вкусный","влажный",
    "внимательный","воздушный","вольный, свободный","восторженный, возбужденный","вредный","всеобщий","высокий",
    "гибкий","гладкий","глубокий","глухой","голодный","гордый","горячий","готовый","грамотный",
    "грубый","грустный","густой","дерзкий","дешевый","дикий","длинный","добрый, мягкий","довольный"
    ,"долгий, продолжительный","доступный","душевный","желанный","железный","желтый","жесткий","живой","жидкий",
    "жизнерадостный","забавный, смешной","заботливый","загадочный","задумчивый","зажиточный","заметный",
    "занятой","здоровый","зеленый","злой","зрелый","идеальный","известный","интересный",
    "искренний","искусный","истинный, правдивый","капризный","кислый","коварный","колючий","комфортный",
    "короткий","крепкий","круглый","ласковый","легкий","ленивый","летучий","лишний","ловкий",
    "логичный","маленький","медленный","мелкий","мертвый","мокрый","молодой","мрачный","мудрый",
    "мягкий","надежный","наивный","настоящий","нежный","независимый, самостоятельный","неизвестный","неловкий",
    "необычный","неприятный","нервный","низкий","новый","нормальный","обидчивый","общительный",
    "обычный, заурядный","опасный","опытный","осторожный","острый","открытый","отличный","отчаянный",
    "очаровательный","пассивный","первый","плоский","плотный","плохой","полезный","последний",
    "похожий","правдивый","прекрасный","приятный","прочный, крепкий","прямой","пустой","пушистый",
    "радостный, веселый","разный","резкий","решительный","романтичный","рудый","русский","рыжий","свежий",
    "светлый","свободный","свой, близкий","седой","сердитый","серый","синий","скромный","слабый",
    "сложный","смелый","смешной, забавный","смуглый","снежный","собственный","современный","соленый",
    "спокойный","старый","стройный","строгий","сухой","суровый","сырой","твердый","теплая",
    "тихий","толстый","трудный","тугой","тусклый","тяжелый","уверенный","угрюмый","узкий","умный",
    "упрямый","уютный","холодный","хороший","храбрый, смелый","худой","цветной","целый","черный",
    "чудесный, волшебный","чуткий","широкий","шумный","энергичный","ясный")

// Наречия А2 26*

val enAdverbsA2 = listOf("endlessly", "unselfishly", "generously", "along", "accordingly",
    "subsequently", "subtly", "precisely", "better", "everywhere", "out", "fully", "partly",
    "utterly", "entirely", "therefore", "hence", "consequently", "bravely", "carefully", "seldom",
    "frequently", "outside", "upstairs", "downstairs", "quite", "early", "simply", "hard", "late")

val ruAdverbsA2 = listOf("бесконечно", "бескорыстно", "щедро", "вдоль, по", "соответственно",
    "впоследствии", "тонко", "точно, четко", "лучше", "везде, где угодно", "за, из", "полностью",
    "частично", "полностью", "совершенно, целиком", "поэтому", "вот почему, отсюда",
    "таким образом, соответственно", "отважно, храбро", "внимательно, осторожно", "редко",
    "часто", "снаружи", "наверху", "внизу", "вполне", "рано", "легко, просто", "трудно", "поздно"
    )

val randomRuAdverbsA2 = listOf(
    "быстро", "медленно", "громко", "тихо", "ярко", "темно", "горячо",
    "холодно", "близко", "далеко", "высоко", "низко", "глубоко", "мелко", "широко", "узко",
    "сильно", "слабо", "весело", "грустно", "смело", "робко", "аккуратно", "небрежно", "ясно",
    "туманно", "прямо", "криво", "ровно", "неровно", "внезапно", "постепенно", "сразу", "позднее"
    , "легко", "тяжело", "просто", "сложно", "быстро, стремительно",
    "медленно, неторопливо","громко, шумно","тихо, бесшумно","ярко, светло","темно, мрачно",
    "горячо, жарко","холодно, ледяно","близко, рядом","далеко, вдали","высоко, вверху",
    "низко, внизу","глубоко, основательно","мелко, поверхностно","широко, просторно",
    "узко, тесно","сильно, мощно","слабо, вяло","весело, радостно","грустно, печально"
)

// B1

// Базовые глаголы B1 31*
val enVerbsB1 = listOf("to abolish", "to approve", "to boast", "to contribute", "to deliver",
    "to descend", "to concentrate", "to distract", "to torture", "to confuse", "to abandon",
    "to escape", "to distribute", "to elaborate", "to construct", "to humiliate", "to maintain",
    "to squeeze", "to delegate", "to transfer", "to employ", "to catch", "to commit", "to arrange",
    "to implement", "to insulate", "to encourage", "to foster", "to boost", "to optimize",
    "to rank", "to identify", "to empower", "to ensure", "to accomplish", "to customize",
    "to localize", "to tailor", "to validate", "to reserve", "to estimate", "to consulate",
    "to regard", "to indicate", "to unify", "to digitalize", "to expose", "to idealize",
    "to navigate", "to sustain", "to constrain", "to evade", "to purchase", "to earn",
    "to make sure", "to prototype", "to endeavour", "to blend", "to prioritize", "to mitigate",
    "to emphasize", "to observe", "to evolve", "to incentivize", "to respond", "to connect",
    "to command", "to check-out", "to extend", "to retain", "to exhibit", "to invent",
    "to abridge", "to self-express", "to neglect", "to negotiate", "to upgrade", "to renew",
    "to specialize", "to balance", "to absorb", "to overwhelm", "to align", "to withdraw",
    "to whistle", "to suspect", "to surrender", "to depend on", "to correct", "to define",
    "to visualize", "to design", "to minimize", "to disturb", "to integrate", "to exchange",
    "to organize", "to collaborate", "to embed", "to generate"
)

val ruVerbsB1 = listOf("отменять, уничтожать, упразднять", "утвердить, одобрить",
    "гордиться, хвастаться", "жертвовать, вносить свой вклад", "доставлять, поставлять, приносить",
    "спуститься, сходить, снизойти", "сосредотачиваться", "отвлечь, отвлекать", "мучить, терзать",
    "путать, запутать, сбить с толку", "покинуть, бросить, оставить",
    "совершить побег, убежать, сбежать", "распространять, распределить",
    "разрабатывать, прорабатывать", "строить, построить", "унижать", "поддерживать",
    "сжимать, выжимать, сжать", "делегировать, посылать", "передавать, перечислять",
    "нанимать, использовать, работать", "поймать, ловить", "совершить, зафиксировать, поручить",
    "организовать, устроить", "внедрить, реализовать, осуществить", "ограждать", "стимулировать",
    "поощрять", "повышать", "оптимизировать", "ранжировать", "идентифицировать",
    "наделить полномочиями, расширять", "обеспечить, убедить, гарантировать",
    "выполнить, завершить, осуществить", "настроить, сделать", "локализовать",
    "приспособить", "удостоверять", "резервировать", "оценивать", "консультировать",
    "рассматривать, учитывать, относиться", "указывать, обозначать, показывать", "объединять",
    "оцифровать", "подвергать", "идеализировать", "ориентироваться",
    "выдерживать", "сдерживать", "обойти", "приобретать", "зарабатывать", "убедиться",
    "создать протопит, план", "стремиться", "смешивать", "расставить приоритеты",
    "смягчать, принимать", "подчеркнуть, придать акцент", "наблюдать, замечать",
    "развиваться, расти, проявляться", "стимулировать, побуждать", "реагировать, отвечать",
    "соединить", "командовать", "проверить, оформить", "продлить, расширить, увеличить",
    "оставить, удержать, сохранить", "показывать", "изобретать", "ограничивать",
    "самовыражаться", "пренебрегать", "договариваться, вести переговоры", "повышать, улучшать",
    "обновить", "специализироваться", "уравновешивать", "поглощать", "переполнять", "выравнивать",
    "отстраниться", "свистеть", "подозревать", "сдаваться", "зависеть от", "исправлять",
    "обозначить", "визуализировать", "проектировать", "минимизировать", "нарушить, беспокоить",
    "интегрировать", "обменивать, менять", "организовать", "сотрудничать", "встраивать",
    "генерировать"
)

val randomRuVerbsB1 = listOf(
    "анализировать, исследовать",
    "благодарить, выражать признательность",
    "вдохновлять, воодушевлять","верить, доверять",
    "влиять, воздействовать",
    "восстанавливать, реставрировать",
    "воспринимать, понимать",
    "вступать, присоединяться",
    "выражать, формулировать",
    "выявлять, обнаруживать",
    "гасить, тушить",
    "двигаться, перемещаться",
    "демонстрировать, показывать",
    "достигать, добиваться",
    "допускать, разрешать",
    "драматизировать, преувеличивать",
    "желать, хотеть",
    "защищать, оберегать",
    "изменять, модифицировать",
    "избегать, уклоняться",
    "излагать, описывать",
    "измерять, оценивать",
    "испытывать, проверять",
    "исчезать, пропадать",
    "копировать, дублировать",
    "корректировать, исправлять",
    "критиковать, осуждать",
    "любить, обожать",
    "манипулировать, управлять",
    "мечтать, фантазировать",
    "наказывать, карать",
    "начинать, стартовать",
    "направлять, ориентировать",
    "наслаждаться, радоваться",
    "нарушать, прерывать",
    "находить, обнаруживать",
    "обучать, учить",
    "обнимать, заключать в объятия",
    "обогащать, улучшать",
    "общаться, взаимодействовать",     "объяснять",
    "ободрять",
    "обожать",
    "обосновывать",
    "обходить",
    "обустраивать",
    "обхватывать",
    "обыгрывать",
    "оглашать",
    "одалживать",
    "ожидать",
    "озарять",
    "оздоравливать",
    "окунать",
    "олицетворять",
    "омрачать",
    "определять",
    "опережать",
    "опираться",
    "оправдывать",
    "опускать",
    "осваивать",
    "освобождать", "освещать","ослаблять","осознавать","останавливать","осуществлять","отдавать",
    "отказывать","отражать","отдыхать","откладывать","отмечать","относиться","отпускать",
    "отстаивать","отступать","обучаться","очаровывать","очищать","ошибаться","падать",
    "переводить","переживать","переключать","переосмысливать","переоценивать","повторять",
    "побеждать","подражать","подчиняться","поздравить","покидать",
    "понимать","помогать")

// Молодежь, современное поведение B1*
val enNounsTeensB1 = listOf("addiction", "amateur", "ambivalence", "commission", "confidence",
    "craving", "district", "evidence", "honesty", "circumstance", "kindness", "justice", "disgust",
    "а suggestion", "а nobility", "commotion", "adherence", "devotion", "enticement",
    "attractiveness", "freedom-loving", "rebel", "influence", "sway", "willpower", "inequality",
    "а violence", "а bullying", "а godliness", "а compassion", "inclusivity", "а reciprocity",
    "friskiness", "fervor", "а youth", "adolescence", "а prerequisite", "fortune", "а stubbornness",
    "disappointment"
)

val ruNounsTeensB1 = listOf("зависимость, пристрастие", "любитель", "нерешительность",
    "комиссия", "доверие, уверенность", "желание, жажда", "район", "доказательство", "честность",
    "обстоятельство", "доброта", "справедливость", "отвращение, брезгливость",
    "предложение, суждение, идея", "благородство, достоинство", "суета", "приверженность",
    "преданность", "приманка, соблазн", "привлекательность", "свободолюбие",
    "бунтарь", "влияние", "колебание", "сила воли", "неравенство", "насилие, жестокость",
    "издевательство, травля", "благочестие, бодрость", "сострадание", "инклюзивность",
    "взаимность, обоюдность", "игривость, раскованность, живость", "пылкость, задор, рвение",
    "молодежь, юноша", "подростковый возраст", "обязательное условие", "судьба, удача",
    "упрямость", "разочарование"
)

val randomRuNounsTeensB1 = listOf("стиль, мода", "тренд", "социум", "сообщество, группа", "стиль жизни",
    "культура", "субкультура", "группа, команда", "дружба", "связь", "связи", "сетевое общени",
    "социальные сети", "интернет", "технологии, гаджеты", "смартфон", "ноутбук", "таблет",
    "игры", "киберспорт", "музыка", "концерт, фестиваль", "танцы, хореография", "театр",
    "кино", "сериал", "книга", "литература", "поэзия", "искусство", "выставка", "галерея",
    "фотография", "видео", "блог", "влог", "путешествие", "туризм", "приключение", "экстрим",
    "спорт", "фитнес", "здоровье", "питание", "диета", "баланс, хармония", "релаксация",
    "медитация", "йога", "психология", "саморазвитие, личностный рос", "образование",
    "университет", "колледж", "курс", "семинар", "тренинг", "менторство", "наставничество",
    "карьера, профессия", "бизнес", "предпринимательство", "инновации", "творчество", "идея",
    "проект", "команда", "коллектив", "сотрудничество, партнерство", "сеть, контакты", "встреча",
    "конференция", "форум", "дебаты", "дискуссия", "обсуждение", "взгляд, мнение", "отзыв",
    "рекомендация", "открытие", "новость", "тенденция", "аналитика", "статистика", "исследование",
    "эксперимент", "инкубатор", "акселератор", "инкубатор проектов", "центр инноваций"
)

// Социальные взаимодействие в пост ковидный период B1*

val enNounsPostCovidB1 = listOf("distancing", "isolation", "self-care", "medication", "celebration",
    "physician", "treatment", "improvement", "symptom", "dismay", "cancellation", "suspiciousness",
    "escalation", "proceeding", "awareness", "responsibility", "aftermath", "weakness", "rivalry",
    "restlessness", "uncertainty", "stress resistance", "conscience", "а mindfulness", "protection",
    "referral", "hopelessness", "reliability", "verification", "self-isolation", "а provocation",
    "prevention", "side effect", "vaccination", "immunization", "contradiction", "emotion",
    "disagreement", "misunderstanding", "negotiation"
)

val ruNounsPostCovidB1 = listOf("дистанцирование", "изоляция", "забота о себе", "лекарство",
    "мероприятие", "врач", "лечение", "улучшение", "симптом", "огорчение", "отмена",
    "подозрительность", "обострение", "разбирательство", "осознание", "ответственность",
    "последствие", "слабость", "соперничество, противостояние", "беспокойство",
    "неуверенность", "стрессоустойчивость", "совесть", "внимательность, мышление",
    "защита", "направление", "безнадежность", "надежность", "проверка", "самоизоляция",
    "провокация", "профилактика", "побочный эффект", "вакцинация", "иммунизация", "противоречие",
    "эмоция", "разногласие", "недопонимание", "переговоры"
)

val randomRuNounsPostCovidB1 = listOf("пандемия", "кризис", "реабилитация, восстановление",
    "экономика", "рынок", "торговля", "индустрия", "туризм", "путешествия", "авиация", "транспорт",
    "логистика", "цепочка поставок", "производство", "работа, занятость", "безработица",
    "финансы", "инвестиции", "бюджет", "стабилизация", "реформы", "политика", "государство",
    "управление, регуляторика", "нормативы, стандарты", "безопасность", "санитария", "гигиена",
    "эпидемиология", "вирусология", "исследования", "наука", "технологии, инновации",
    "цифровизация", "онлайн-образование", "удаленная работа", "телемедицина",
    "цифровое здравоохранение", "информатика", "кибербезопасность", "защита данных",
    "конфиденциальность", "права человека", "социальная поддержка", "благосостояние",
    "психическое здоровье", "социология", "демография", "статистика", "аналитика",
    "прогнозирование", "стратегия, план", "реализация", "мониторинг", "контроль", "оценка",
    "аудит", "риск-менеджмент", "кризис-менеджмент", "коммуникации", "pr", "маркетинг", "брендинг",
    "репутация", "доверие", "устойчивость", "ресилентность", "адаптивность", "гибкость",
    "кооперация", "партнерство, сотрудничество", "международное сотрудничество",
    "глобальная координация"
)

// Жизненные успехи и провалы B1*

val enNounsSuccessB1 = listOf("downfall", "а setback", "а bad luck", "depression", "а solitude",
    "а self-blame", "а disorder", "а instability", "а challenge", "а sustainability", "duration",
    "а luckiness", "а fluke", "а winning", "lottery", "destination", "advantage", "win-win",
    "condition", "contest", "а humbleness", "а fearlessness", "а hardening", "а buoyancy",
    "а cheerfulness", "а hospitality", "а pessimism", "а morale", "а wisdom", "а prociency",
    "applicant", "а decisiveness", "а loophole", "а frustration", "а knowledge",
    "а decision-making", "alacrity", "extremity", "а background", "а preparatory",
)

val ruNounsSuccessB1 = listOf("падение, крах", "неудача, сбой", "неудача, невезение", "депрессия",
    "одиночество", "самообвинение", "беспорядок, расстройство", "нестабильность", "вызов",
    "устойчивость", "продолжительность", "удачливость", "случайность, удача", "победа", "лотерея",
    "пункт назначения", "преимущество", "выигрыш для всех", "условие, состояние",
    "соревнование, конкурс", "скромность", "бесстрашие", "закалка, упрочнение",
    "подвижность, живость", "веселость", "гостеприимство", "пессимизм", "боевой дух", "мудрость",
    "компетентность, умение", "заявитель, претендент", "решительность", "лазейка, пробел",
    "разочарование, раздражение", "знания", "принятие решений", "быстрота, энергичность",
    "крайность", "фон, предыстория", "подготовительный"
)

val randomRuNounsSuccessB1 = listOf("успех", "провал", "реализация", "неудача", "достижение",
    "крах", "рост", "спад", "развитие", "застой", "победа", "поражение", "взлет", "падение",
    "успехи", "неудачи", "план", "стратегия", "тактика", "риск", "выгода", "убыток", "инвестиции",
    "дивиденды", "рентабельность", "эффективность", "нерентабельность", "конкуренция", "монополия",
    "кооперация", "партнерство", "сотрудничество", "конфликт", "соглашение", "компромисс",
    "условия", "требования", "ограничения", "возможности", "шансы", "перспективы", "цели",
    "задачи", "решения", "последствия", "анализ", "оценка", "прогноз", "стратегия выхода",
    "кризис-менеджмент", "риск-менеджмент", "финансовая стабильность", "экономическая стабильность",
    "социальная стабильность", "политическая стабильность", "инновации", "технологии", "наука",
    "исследования", "эксперименты", "открытия", "нововведения", "патенты", "лицензии", "франшизы",
    "бренд", "репутация", "имидж", "маркетинг", "pr", "реклама", "продвижение", "сбыт",
    "распределение", "логистика", "снабжение", "производство", "контроль качества", "сертификация",
    "аккредитация"
)

// Базовые прилагательные B1*

val enAdjectivesB1 = listOf("arrogant", "civilian", "commercial", "convenient", "creative",
    "naughty", "stationary", "valuable", "significant", "foremost", "recent", "updated",
    "operational", "intuitive", "essential", "numerous", "compliant", "straightforward",
    "understandable", "uncompromising", "distinguished", "separate", "outstanding", "principal",
    "leading", "cognitive", "cutting-edge", "precise", "unmatched", "reasonable", "fundamental",
    "brilliant", "inflexible", "crucial", "contemporary", "duplicated", "tedious", "multiple",
    "individual", "fitting", "monotonous", "ruthless", "multi-channel", "astonishing", "ambitious",
    "captivating", "profound", "qualified", "remarkable", "additional", "burning", "unassuming",
    "meaningful", "private", "careful", "obscure", "accomplished", "ridiculous", "contemptuous",
    "fashionable"
)

val ruAdjectivesB1 = listOf("высокомерный", "гражданский", "коммерческий", "удобный", "творческий",
    "непослушный", "стационарный", "ценный", "значительный", "прежде всего", "недавний",
    "обновленный", "оперативный", "интуитивный", "необходимый", "многочисленный",
    "соблюдающий правила", "прямолинейный", "понятный", "безкомпромиссный", "отличительный",
    "отдельный", "выдающийся", "основной", "руководящий", "когнитивный", "передовой", "точный",
    "непревзойденный", "разумный", "основополагающий", "блестящий", "непреклонный", "критический",
    "современный", "дублированный", "скучный", "множественный", "индивидуальный", "подходящий",
    "монотонный", "безжалостный", "мультиканальный", "ошеломляющий", "амбициозный", "захватывающий",
    "глубокий", "квалифицированный", "замечательный", "дополнительный", "пылкий", "скромный",
    "значимый", "частный", "осторожный", "неясный", "достигнутый", "смехотворный",
    "пренебрежительный", "модный"
)

val randomRuAdjectivesB1 = listOf("совершенный", "идеальный", "уникальный", "необычный",
    "экстравагантный", "элегантный", "сдержанный", "романтический", "сентиментальный",
    "ностальгический", "веселый", "жизнерадостный", "энтузиастический", "позитивный",
    "оптимистичный", "пессимистичный", "реалистичный", "прагматичный", "рациональный",
    "эмоциональный", "интеллектуальный", "аналитический", "критический", "конструктивный",
    "деструктивный", "сложный", "простой", "ясный", "неясный", "сложный", "многогранный",
    "разнообразный", "цветной", "мрачный", "светлый", "теплый", "холодный", "сухой", "влажный",
    "широкий", "узкий", "глубокий", "мелкий", "длинный", "короткий", "тонкий", "толстый", "легкий",
    "тяжелый", "быстрый", "медленный", "сильный", "слабый", "выносливый", "хрупкий", "гибкий",
    "жесткий", "мягкий", "твердый", "плотный", "рыхлый", "пустой", "наполненный", "полный",
    "свободный", "занятый", "свободолюбивый", "дисциплинированный", "беспорядочный", "порядочный",
    "чистый", "грязный", "свежий", "старый", "новый", "устаревший", "современный", "традиционный",
    "необычный", "оригинальный", "копированный", "авторский", "уникальный", "массовый",
    "эксклюзивный", "доступный", "недоступный", "дорогой", "дешевый", "качественный",
    "некачественный", "прочный", "хрупкий", "устойчивый", "неустойчивый", "гармоничный",
    "дисгармоничный"
)

// Базовые наречия B1 *

val enAdverbsB1 = listOf("invariably", "intermittently", "infrequently", "predominantly",
    "elsewhere", "scarcely", "otherwise", "quickly", "quietly", "moreover", "nevertheless",
    "somewhat", "cheerfully", "clumsily", "in vain", "at once", "casually", "since that",
    "by all means", "readily", "outside", "besides", "once", "however", "yet", "foolishly",
    "clearly", "actually", "completely", "extremely", "nearby", "unmistakable", "accurately",
    "definitely", "relentlessly", "incredibly", "decidedly", "firmly", "carelessly", "nevertheless"
)

val ruAdverbsB1 = listOf("иногда", "редко", "постоянно", "где-нибудь", "едва", "иначе", "быстро",
    "спокойно, тихо", "более того", "тем не менее", "до некоторой степени", "весело", "неуклюже",
    "напрасно", "немедленно", "случайно", "с тех пор", "во что бы то ни стало", "охотно", "снаружи",
    "кроме того", "однажды", "однако, как бы ни", "еще, до сих пор", "глупо, по глупости",
    "очевидно", "в общем, вообще-то", "совершенно, абсолютно", "безумно", "рядом, неподалеку",
    "безошибочно", "точно", "абсолютно", "безостановочно", "невероятно, очень, неимоверно",
    "решительно", "уверенно", "беспечно", "тем не менее"
)

val randomRuAdverbsB1 = listOf("часто", "везде", "всегда, постоянно", "далеко", "близко",
    "медленно, неспешно", "аккуратно", "быстрее", "внезапно", "молча", "искренне, честно",
    "уверенно", "прямо", "косвенно", "незаметно, скрытно", "громко", "резко", "тихонько, осторожно",
    "сильно", "слабо", "легко, просто", "трудно", "строго", "лояльно, терпимо", "четко", "размыто",
    "внимательно, сосредоточенно", "невнимательно", "умело", "неумело, неуклюже", "смело",
    "осторожно", "опасно, рискованно", "надежно", "ненадежно", "энергично, активно", "пассивно",
    "искусственно, ненатурально", "естественно", "привычно, обычно", "необычно, странно", "успешно",
    "безуспешно, неудачно", "бесперебойно", "с перебоями", "правильно, корректно",
    "неправильно, ошибочно", "легкомысленно", "серьезно", "полезно", "бесполезно, напрасно",
    "заблаговременно", "поздно", "своевременно", "несвоевременно", "спонтанно", "планомерно"
)

// B2

